tests/data/olap_outputs/fact_invoices.csv

invoice_id,customer_id,customer_email,amount_paid,currency,status,created_at,period_start,period_end,product_id,product_name,price_id,plan_amount,plan_interval,subscription_id,payment_method_type,receipt_number,livemode,card_brand
in_1RTmwlH1lINcoHaahLyXzWlr,cus_SOa6bpMu879kKO,marc@example.com,1200,eur,paid,2025-05-28 18:35:19,2025-05-28 18:35:18,2025-05-28 18:35:18,prod_SOa6bpvQORBghB,Premium Plan,price_1RTmwZH1lINcoHaaAyfIKRKI,1200,month,sub_1RTmwlH1lINcoHaahlNybnXp,,2072-1714,False,
in_1RTmwgH1lINcoHaaz0bEqfRi,cus_SOa6LLDPO9uZGq,alice@example.com,800,eur,paid,2025-05-28 18:35:14,2025-05-28 18:35:13,2025-05-28 18:35:13,prod_SOa6QdWj0J55jl,Standard Plan,price_1RTmwaH1lINcoHaaFzqwN0c8,800,month,sub_1RTmwgH1lINcoHaagnFg7pWu,,2899-2246,False,
in_1RTmwbH1lINcoHaaWUz8MY01,cus_SOa6Ahx6rairaP,jean@example.com,1200,eur,paid,2025-05-28 18:35:09,2025-05-28 18:35:09,2025-05-28 18:35:09,prod_SOa6bpvQORBghB,Premium Plan,price_1RTmwZH1lINcoHaaAyfIKRKI,1200,month,sub_1RTmwbH1lINcoHaaBK5mfBYu,,2367-1922,False,
